# Data Ingestion

* `Pandas DataFrame` 

* `Pandas I/O`

* `Pandas Groupby` 

* `Pandas Concat and Merge`

---

### `Pandas DataFrame`


> A Pandas DataFrame is a two-dimensional, tabular data structure in the Python library Pandas, often used for data analysis and manipulation.   
> It is similar to a spreadsheet in Excel or a SQL table and provides flexible and powerful ways to handle data.
   
> Here are some of the key features of a Pandas DataFrame:  

> - **Rows and Columns:** A DataFrame consists of rows and columns, where each column has a name (column label) and each row has an index (row label).
> - **Data Integration:** A DataFrame can read data from various sources like CSV files, Excel files, SQL databases, JSON files, and more.
> - **Data Manipulation**: You can add, remove, or rename columns, filter data, group, aggregate, and merge data.
> - **Flexibility**: A DataFrame can contain different data types in different columns, such as numerical values, strings, dates, and more.

> For full documentation please see: [Pandas User Guide](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)

Import Pandas library

In [ ]:
import pandas as pd

Create <u>empty</u> Pandas DataFrame

In [ ]:
df = pd.DataFrame()

In [ ]:
display(df)

In [ ]:
print(type(df))

Create <u>empty</u> Pandas DataFrame <u>with row and column labels</u>

In [ ]:
df = pd.DataFrame(index=[1, 2, 3], columns=["Column1", "Column2", "Column3"])

In [ ]:
display(df)

In [ ]:
print(type(df))

Create DataFrame <u>with example data</u>

In [ ]:
example_data = {
  "Name": {
    "0": "Alice",
    "1": "Bob",
    "2": "Charlie",
    "3": "David",
    "4": "Eva"
  },
  "Age": {
    "0": 24,
    "1": 27,
    "2": 22,
    "3": 32,
    "4": 29
  },
  "City": {
    "0": "New York",
    "1": "Los Angeles",
    "2": "Chicago",
    "3": "Houston",
    "4": "Phoenix"
  }
}

In [ ]:
df = pd.DataFrame(example_data)

In [ ]:
display(df)

### `Pandas I/O`

> The pandas I/O API is a set of top level `reader` functions accessed like `pandas.read_csv()` that generally return a pandas object. 
> The corresponding `writer` functions are object methods that are accessed like `DataFrame.to_csv()`. 

> Below is a table containing just some examples for available `readers` and `writers`. 

> For full documentation please see: [Pandas User Guide](https://pandas.pydata.org/docs/user_guide/io.html)

| **Format** | **Reader** | **Writer** |
|----------|----------|----------|
| XLSX | read_excel | to_excel |
| CSV | read_csv | to_csv |
| JSON | read_json | to_json |
| SQL | read_sql | to_sql |

##### `XLSX` **Files**

In [ ]:
#%pip install openpyxl

In [ ]:
import openpyxl

In [ ]:
# Path
xlsx_file_path = "data/example.xlsx"

In [ ]:
# Writer
df.to_excel(xlsx_file_path, index=False)

In [ ]:
# Reader
xlsx_df = pd.read_excel(xlsx_file_path)

In [ ]:
display(xlsx_df)

In [ ]:
print(type(xlsx_df))

##### `CSV` **Files**

In [ ]:
# Path
csv_file_path = "data/example.csv"

In [ ]:
# Writer
df.to_csv(csv_file_path, index=False)

In [ ]:
# Reader
csv_df = pd.read_csv(csv_file_path)

In [ ]:
display(csv_df)

In [ ]:
print(type(csv_df))

##### `JSON` **Files**

In [ ]:
# Path
json_file_path = "data/example.json"

In [ ]:
# Writer
df.to_json(json_file_path, orient="columns")

In [ ]:
# Reader
json_df = pd.read_json(json_file_path)

In [ ]:
display(json_df)

In [ ]:
print(type(json_df))

##### `SQL` **Database**

In [ ]:
%pip install pymysql sqlalchemy

In [ ]:
from sqlalchemy import create_engine

<u>Create connection</u> to saklia MySQL database

In [ ]:
host = "localhost"
user = "root"
password = pd.read_json("config/database_config")["password"][0]
database = "sakila"

# Connection string
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}/{database}")

<u>Read data</u> from sakila MySQL database

In [ ]:
query = "SELECT * FROM actor;"

In [ ]:
sql_df = pd.read_sql(sql=query, con=engine)

In [ ]:
display(sql_df.head(5))

<u>Write data</u> to sakila MySQL database

In [ ]:
new_records = {
  "first_name": {
    "0": "John",
    "1": "Leonardo",
    "2": "Brad",
    "3": "Matt",
    "4": "Edward"
  },
  "last_name": {
    "0": "Travolta",
    "1": "Di Caprio",
    "2": "Pitt",
    "3": "Damon",
    "4": "Norton"
  }
}

In [ ]:
df_new_records = pd.DataFrame(new_records)

In [ ]:
display(df_new_records)

In [ ]:
df_new_records.to_sql(name="t_actor", con=engine, if_exists="append", index=False)

💡 HINT:

You can create the database table `t_actor` in your MySQL workbench using the follwing sql statement:

```sql
USE sakila;

CREATE TABLE t_actor (
    first_name VARCHAR(255),
    last_name VARCHAR(255)
);

### `Pandas Groupby`

> A groupby operation involves some combination of splitting the object, applying a function, and combining the results.   
> This can be used to group large amounts of data and compute operations on these groups.

> For full documentation please see: [Pandas User Guide](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)

##### **Example Data**

Create DataFrame with products and dates

In [ ]:
# Products
products = ["A", "B", "C"]

# Dates ranging from 2023-01-01 to 2023-12-31
dates = pd.date_range(start='2023-01-01', end='2023-12-31')

# Cartesian product
df = pd.DataFrame([(product, date) for product in products for date in dates],
                  columns=['product', 'date'])

In [ ]:
pd.set_option('display.max_rows', None)  # Show all rows
pd.set_option('display.max_columns', None)  # Show all columns

print(f"df contains {len(products)} x {len(dates)} = {len(df)} rows")
display(df.head(5))
display(df.tail(5))

Extract quarter, month, week and weekday from dates

In [ ]:
# Quarter
df["quarter"] = df["date"].dt.quarter
# Month
df["month"] = df["date"].dt.month
# Week
df["week"] = df["date"].dt.isocalendar().week
# Weekday
df["weekday"] = df["date"].dt.weekday

In [ ]:
display(df.head(5))
display(df.tail(5))

Add column with random sales

In [ ]:
import numpy as np

# Random seed for reproducability
np.random.seed(42)

# Random sales
df["sales"] = np.random.randint(10000, 50000, size=len(df))

In [ ]:
display(df.head(5))
display(df.tail(5))

Add missing values

In [ ]:
# Number of NaN values
num_nan = 95

# Random seed for reproducability
np.random.seed(42)

# Random indices to set as NaN
nan_indices = np.random.choice(df.index, size=num_nan)

# Replace with NaN
df.loc[nan_indices, "sales"] = np.NaN

In [ ]:
display(df.head(20))

##### **Aggregation operations**

<u>Single</u> Aggregations

In [ ]:
# Sum
df_sum = df.groupby(by=["product"], as_index=False)["sales"].sum()

In [ ]:
display(df_sum)

In [ ]:
# Mean
df_mean = df.groupby(by=["product"], as_index=False)["sales"].mean()

In [ ]:
display(df_mean)

In [ ]:
# Median
df_median = df.groupby(by=["product"], as_index=False)["sales"].median()

In [ ]:
display(df_median)

In [ ]:
# Minimum
df_min = df.groupby(by=["quarter"], as_index=False)["sales"].min()

# Maximum
df_max = df.groupby(by=["quarter"], as_index=False)["sales"].max()

In [ ]:
display(df_min)

In [ ]:
display(df_max)

In [ ]:
# Size (missing values included)
df_size = df.groupby(by=["month"], as_index=False)["sales"].size()

# Count (missing values excluded)
df_count = df.groupby(by=["month"], as_index=False)["sales"].count()

In [ ]:
display(df_size)

In [ ]:
display(df_count)

In [ ]:
# Unique values count
df_nunique = df.groupby(by=["product"], as_index=False)["week"].nunique()

In [ ]:
display(df_nunique)

<u> Multiple </u> Aggregations

In [ ]:
df_agg = df.groupby(by=["weekday"], as_index=False).agg(
    {"sales": ["count", "min", "mean", "median", "max"]}
)

In [ ]:
display(df_agg)

<u>Custom</u> Aggregations

In [ ]:
# Custom function
def range_func(x):
    return x.max() - x.min()

In [ ]:
df_custom_agg = df.groupby(by=["weekday"], as_index=False).agg(
    {"sales": ["count", "min", "mean", "median", "max", range_func]}
)

In [ ]:
display(df_custom_agg)

Aggregation with <u>multiple group columns</u>

In [ ]:
df_agg_multiple = df.groupby(by=["product", "weekday"], as_index=False).agg(
    {"sales": ["count", "min", "mean", "median", "max", range_func]}
)

In [ ]:
display(df_agg_multiple)

<u>Rolling</u> Aggregates

In [ ]:
df_rolling_agg = df.copy()

In [ ]:
# Rolling Sum, Mean, Std Deviation
result = df["sales"].rolling(window=3).agg(["sum", "mean", "std"])

df_rolling_agg[["sales_roll_sum_3", "sales_roll_mean_3", "sales_roll_std_3"]] = result

In [ ]:
display(df_rolling_agg.head(10))

### `Pandas Concat and Merge`

##### `Concat`

> Concatenate pandas objects along a particular axis.

> For full documentation please see: [Pandas User Guide](https://pandas.pydata.org/docs/reference/api/pandas.concat.html)

##### **Example Data**

Divide `df` into three sub datasets - one per product

In [ ]:
df_A = df.loc[df["product"] == "A"]
df_B = df.loc[df["product"] == "B"]
df_C = df.loc[df["product"] == "C"]

In [ ]:
display(df_A.head(5))

In [ ]:
display(df_B.head(5))

In [ ]:
display(df_C.head(5))

##### **Concatenation operations**

Stack DataFrames with <u>identical columns</u> on top of each other

In [ ]:
df_concat = pd.concat(objs=[df_A, df_B, df_C], axis=0)

In [ ]:
display(df_concat.head(5))
display(df_concat.tail(5))

Stack DataFrames with <u>overlapping columns</u> on top of each other

In [ ]:
df_C_drop = df_C.drop(columns=["quarter", "month", "week", "weekday"])

In [ ]:
display(df_C_drop.head(5))

In [ ]:
df_concat_with_nan = pd.concat(objs=[df_A, df_B, df_C_drop], axis=0)

In [ ]:
display(df_concat_with_nan.head(5))
display(df_concat_with_nan.tail(5))

Append a <u>single row to the end</u> of a DataFrame

In [ ]:
new_row = pd.Series(
    {
        "product": "A",
        "date": pd.to_datetime("2024-01-01"),
        "quarter": 1,
        "month": 1,
        "week": 52,
        "weekday": 0,
        "sales": 99999.0,
    }
)

In [ ]:
df_A_new_row = pd.concat([df_A, new_row.to_frame().T], ignore_index=True)

In [ ]:
display(df_A_new_row.tail(10))

##### `Merge`

> Merge DataFrame or named Series objects with a database-style join.

> For full documentation please see: [Pandas User Guide](https://pandas.pydata.org/docs/reference/api/pandas.merge.html)

##### **`LEFT JOIN`**

**We want to select all <u>ACTION</u> movies from sakila database joining the follwing database tables:**

* **`film`**: contains columns `film_id`, `title`,  ...  

* **`category`**: contains columns `category_id`, `name`

* **`film_category`**: contains columns `film_id`, `category_id`

Step 1: Load database tables

In [ ]:
query_film = "SELECT film_id, title FROM film;"
query_category = "SELECT category_id, name FROM category;"
query_film_category = "SELECT film_id, category_id FROM film_category;"

In [ ]:
df_film = pd.read_sql(sql=query_film, con=engine)
df_category = pd.read_sql(sql=query_category, con=engine)
df_film_category = pd.read_sql(sql=query_film_category, con=engine)

In [ ]:
display(df_film.head(5))
display(df_category.head(5))
display(df_film_category.head(5))

Step 2: Perform **`LEFT JOIN`** to join `category_id` from `film_category` table to `film` table

In [ ]:
df_joined = pd.merge(
    # Left table
    left=df_film,
    # Right table
    right=df_film_category,
    # Join type
    how="left",
    # Join key of left table
    left_on="film_id",
    # Join key of right table
    right_on="film_id",  
)

In [ ]:
display(df_joined.head(10))

Step 3: Perform another **`LEFT JOIN`** to join `name` from `category` to the joined table

In [ ]:
df_joined = pd.merge(
    # Left table
    left=df_joined,
    # Right table
    right=df_category,
    # Join type
    how="left",
    # Join key of left table
    left_on="category_id",
    # Join key of right table
    right_on="category_id"
)

In [ ]:
display(df_joined.head(10))

Step 4: Select <u>action</u> movies

In [ ]:
df_action_movies = df_joined.loc[df_joined["name"] == "Action", :].reset_index()

In [ ]:
print(f"sakila database contains {len(df_action_movies)} action movies")

In [ ]:
display(df_action_movies.head(5))
display(df_action_movies.tail(5))

##### **`INNER JOIN`**

**We want to select all <u>FILMS</u> with actor <u>CATE HARRIS</u> from sakila database joining the follwing database tables:**

* **`film`**: contains columns `film_id`, `title`,  ...  

* **`film_actor`**: contains columns `actor_id`, `film_id`  

* **`actor`**: contains columns `actor_id`, `first_name`, `last_name`

Step 1: Load database tables

In [126]:
# Films (with actors)
query_film_actor = """
SELECT a.actor_id, a.film_id, b.title 
FROM film_actor as a
LEFT JOIN film as b
ON a.film_id = b.film_id;
"""

df_film_actor = pd.read_sql(sql=query_film_actor, con=engine)

display(df_film_actor.head(5))

   actor_id  film_id             title
0         1        1  ACADEMY DINOSAUR
1        10        1  ACADEMY DINOSAUR
2        20        1  ACADEMY DINOSAUR
3        30        1  ACADEMY DINOSAUR
4        40        1  ACADEMY DINOSAUR

In [127]:
# Actors
query_actor = """
SELECT actor_id, first_name, last_name 
FROM actor
WHERE first_name = "CATE" AND last_name = "HARRIS";
"""

df_actor = pd.read_sql(sql=query_actor, con=engine)

display(df_actor)

   actor_id first_name last_name
0       141       CATE    HARRIS

Step 2: Perform **`INNER JOIN`** to only return `film_id`s from `film_actor` table that correspond with `actor_id`s present in `actor` table

In [132]:
df_harris_movies = pd.merge(
    # Left table
    left=df_film_actor,
    # Right table
    right=df_actor,
    # Join type
    how="inner",
    # Join key of left table
    left_on="actor_id",
    # Join key of right table
    right_on="actor_id",  
)

In [133]:
print(f"sakila database contains {len(df_harris_movies)} movies with actor CATE HARRIS")

sakila database contains 28 movies with actor CATE HARRIS

In [134]:
display(df_harris_movies.head(5))
display(df_harris_movies.tail(5))

   actor_id  film_id             title first_name last_name
0       141       43    ATLANTIS CAUSE       CATE    HARRIS
1       141       67      BERETS AGENT       CATE    HARRIS
2       141      188        CRAZY HOME       CATE    HARRIS
3       141      191   CROOKED FROGMEN       CATE    HARRIS
4       141      207  DANGEROUS UPTOWN       CATE    HARRIS

    actor_id  film_id             title first_name last_name
23       141      849   STORM HAPPINESS       CATE    HARRIS
24       141      862   SUMMER SCARFACE       CATE    HARRIS
25       141      863   SUN CONFESSIONS       CATE    HARRIS
26       141      909  TREASURE COMMAND       CATE    HARRIS
27       141      992        WRATH MILE       CATE    HARRIS